# Pandas intro

The most common way for data to be stored and displayed is using spreadsheets, such as Excel.  In an Excel file, data is organized into 
columns and rows. In data science, the concept of spreadsheets is expressed as data frames, which are like Excel pages that can be manipulated 
using code.  Both R and Python make use of data frames as fundamental building blocks for analysis.

In python, the most widely used package for data frame work is [pandas](https://pandas.pydata.org/).  It is ubiquitous in Python data science applications.  When doing single cell RNA seq analysis in Python, the main tool is [scanpy](https://scanpy.readthedocs.io/en/stable/index.html), which is built around the [AnnData](https://anndata.readthedocs.io/en/latest/) data type.  AnnData objects use pandas style DataFrames to hold both gene and cell data as well as a matrix representing gene expression per cell.  So, in order to be able to work with AnnData objects, it is necessary to have some understanding of pandas datatypes.

## Online pandas tutorials

I highly recommend the free YouTube tutorials by [Corey Schafer](https://www.youtube.com/watch?v=ZyhVh-qRZPA&list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS). 
They should provide you with everything you need to work with pandas data frames.  He also has excellent videos on related topics including 
Python programming.

## Exercises

### Loading data

In [ ]:
#
# load pandas into this notebook
# use it to read in a data file located at "data/folks.csv"
# then show the first few rows of data
#

In [32]:
import pandas as pd
df = pd.?       # traditional DataFrames are given the name df, created calling a  pandas function
df.?              # hint: you need to call one of df's methods to generate the table below.

  First Name Last Name Occupation     Sex  Age  Weight  Income
0        Ted    Turner     Tinker    Male   33      70   50000
1      Carol      King     Tailor  Female   27      50   60000
2      Alice    Toklas    Soldier  Female   48      60   70000
3        Bob    Barker        Spy    Male   61      80   55000

### Working with column names

In [71]:
#
# what are the column names?
#
df.?

Index(['First Name', 'Last Name', 'Occupation', 'Sex', 'Age', 'Weight',
       'Income'],
      dtype='object')

In [72]:
# 
# change all the column names to lower case
#
df.columns = df.columns.?
#
# alternatively, you can also do this
df.rename(?, axis='columns')
df.head()

  first name last name occupation     sex  age  weight  income
0        Ted    Turner     Tinker    Male   33      70   50000
1      Carol      King     Tailor  Female   27      50   60000
2      Alice    Toklas    Soldier  Female   48      60   70000
3        Bob    Barker        Spy    Male   61      80   55000

In [74]:
#
# change all the column names to capitalized using a string function
#
df.columns = df.?
df.head()

  First name Last name Occupation     Sex  Age  Weight  Income
0        Ted    Turner     Tinker    Male   33      70   50000
1      Carol      King     Tailor  Female   27      50   60000
2      Alice    Toklas    Soldier  Female   48      60   70000
3        Bob    Barker        Spy    Male   61      80   55000

In [75]:
#
# change the column title "Income" to lower case
#
df.rename(columns=?, inplace=True)
df.head()

  First name Last name Occupation     Sex  Age  Weight  income
0        Ted    Turner     Tinker    Male   33      70   50000
1      Carol      King     Tailor  Female   27      50   60000
2      Alice    Toklas    Soldier  Female   48      60   70000
3        Bob    Barker        Spy    Male   61      80   55000

What happens if you don't use `inplace=True`?

In [76]:
#
# correct the titles for first name and last name
#
df.rename(columns={"First name":"First Name", "Last name":"Last Name"}, inplace=True)
df.head()

  First Name Last Name Occupation     Sex  Age  Weight  income
0        Ted    Turner     Tinker    Male   33      70   50000
1      Carol      King     Tailor  Female   27      50   60000
2      Alice    Toklas    Soldier  Female   48      60   70000
3        Bob    Barker        Spy    Male   61      80   55000

In [77]:
#
# Create a new column called "Full Name" from the "First Name" and "Last Name" columns
#
df["Full Name"]= ? 
df.head()

  First Name Last Name Occupation     Sex  Age  Weight  income     Full Name
0        Ted    Turner     Tinker    Male   33      70   50000    Ted Turner
1      Carol      King     Tailor  Female   27      50   60000    Carol King
2      Alice    Toklas    Soldier  Female   48      60   70000  Alice Toklas
3        Bob    Barker        Spy    Male   61      80   55000    Bob Barker

In [78]:
# 
# use a simple approach to create a formatted dollars column
#

def format(x):
    ...
    
df["dollars"]=df["income"].?
df.head()

,First Name,Last Name,Occupation,Sex,Age,Weight,income,Full Name,dolars
0,Ted,Turner,Tinker,Male,33,70,50000,Ted Turner,$50000.00
1,Carol,King,Tailor,Female,27,50,60000,Carol King,$60000.00
2,Alice,Toklas,Soldier,Female,48,60,70000,Alice Toklas,$70000.00
3,Bob,Barker,Spy,Male,61,80,55000,Bob Barker,$55000.00

In [79]:
#
# use a more sophisticated approach to the dollars column, which takes into account local currency formatting
#
import locale

locale.setlocale(locale.LC_MONETARY, "fr_CA")  # French Canada
locale.setlocale(locale.LC_MONETARY, "en_CA")  # English Canada
df["dollars"] = df["income"].apply(locale.currency)
df.head()

,First Name,Last Name,Occupation,Sex,Age,Weight,income,Full Name,dolars,dollars
0,Ted,Turner,Tinker,Male,33,70,50000,Ted Turner,$50000.00,$50000.00
1,Carol,King,Tailor,Female,27,50,60000,Carol King,$60000.00,$60000.00
2,Alice,Toklas,Soldier,Female,48,60,70000,Alice Toklas,$70000.00,$70000.00
3,Bob,Barker,Spy,Male,61,80,55000,Bob Barker,$55000.00,$55000.00

### filtering

In [80]:
#
# Create a new column calls "Is A Spy". It's elements should be True if Occupation is "Spy", False otherwise.
#
df["Is A Spy"]=(? == "Spy")
df.head()

,First Name,Last Name,Occupation,Sex,Age,Weight,income,Full Name,dolars,dollars,Is A Spy
0,Ted,Turner,Tinker,Male,33,70,50000,Ted Turner,$50000.00,$50000.00,False
1,Carol,King,Tailor,Female,27,50,60000,Carol King,$60000.00,$60000.00,False
2,Alice,Toklas,Soldier,Female,48,60,70000,Alice Toklas,$70000.00,$70000.00,False
3,Bob,Barker,Spy,Male,61,80,55000,Bob Barker,$55000.00,$55000.00,True

In [82]:
#
# create a dataframe including only those who are not spies
#
df_not_spy = ?
df_not_spy.head()

,First Name,Last Name,Occupation,Sex,Age,Weight,income,Full Name,dolars,dollars,Is A Spy
0,Ted,Turner,Tinker,Male,33,70,50000,Ted Turner,$50000.00,$50000.00,False
1,Carol,King,Tailor,Female,27,50,60000,Carol King,$60000.00,$60000.00,False
2,Alice,Toklas,Soldier,Female,48,60,70000,Alice Toklas,$70000.00,$70000.00,False

In [83]:
#
# Find the "Full Name", "Sex" and "Income" of those with salaries greater than 50000
# Use an intermediate series to store the logical values
#
i = df["income"] > 50000 # here we create a logical series to filter our data
df_1 = ?
df_1.head()

      Full Name     Sex  income
1    Carol King  Female   60000
2  Alice Toklas  Female   70000
3    Bob Barker    Male   55000